Taverna/app/controllers/items_controller.rb

  def index
    items = Item.all
---
SELECT "items".* FROM "items"

  def create
    item = Item.new(item_params)
    if item.save
---
INSERT INTO "items" ("name", "price", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Harry's Hotdogs"], ["price", 3.25], ["created_at", "2020-07-25 18:03:34.010419"], ["updated_at", "2020-07-25 18:03:34.010419"]]

  def show
    item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def destroy
    binding.pry
    item = Item.find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]